In [64]:
import pandas as pd

In [65]:
df = pd.read_csv("train.csv")

In [71]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [72]:
df.drop(['PassengerId','Name','SibSp','Parch','Cabin', 'Embarked','Ticket'],axis='columns', inplace =True)

In [73]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [75]:
X = df.drop(["Survived"],axis='columns')
y = df.Survived

In [76]:
X.Sex = X.Sex.map({'male':1, 'female':2})

In [77]:
X.isna().sum()

Pclass      0
Sex         0
Age       177
Fare        0
dtype: int64

In [78]:
X.Age = X.Age.fillna(X.Age.mean())

In [79]:
X.isna().sum()

Pclass    0
Sex       0
Age       0
Fare      0
dtype: int64

In [80]:
from sklearn.model_selection import train_test_split

In [82]:
X_train ,X_test,y_train , y_test = train_test_split(X,y,test_size=0.2)

In [84]:
len(X_train)

712

In [88]:
from sklearn import tree
model = tree.DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,max_features=None, max_leaf_nodes=None,min_impurity_split=1e-07, min_samples_leaf=1,min_samples_split=2, min_weight_fraction_leaf=0.0, random_state=None, splitter='best')

In [89]:
model.fit(X_train, y_train)

C:\Users\soura\AppData\Roaming\Python\Python38\site-packages\sklearn\tree\_classes.py:316: FutureWarning: The min_impurity_split parameter is deprecated. Its default value has changed from 1e-7 to 0 in version 0.23, and it will be removed in 1.0 (renaming of 0.25). Use the min_impurity_decrease parameter instead.
  warnings.warn(

DecisionTreeClassifier(min_impurity_split=1e-07)

In [90]:
model.score(X_test,y_test)

0.7877094972067039

In [51]:
# test_df = pd.read_csv("test.csv")

In [30]:
# test_df.drop(['PassengerId','Name','SibSp','Parch','Cabin', 'Embarked','Ticket'],axis='columns', inplace =True)

In [91]:
# test_df

In [33]:
# X = test_df.drop(["Survived"],axis='columns')
# y = test_df.Survived